[
    {
        "rule_id": "cloud_instance_ros_evaluation|CONSUMPTION_MODEL",
        "description":"This instance is idling so consider switching to a consumption model.",
        "reason": "Based on the host metrics set, we have detected that this {system_query.instance_type} instance on {system_query.cloud_provider.upper()} is displaying a higher amount of idling cycles within a 24h time frame. It can be potentially explained by the non-business hours. This idling state may be caused by picking an inappropriate consumption model.",
        "resolution": "Please verify that this instance and its workload is having an appropriate consumption model for this specific workload.",
        "condition":"CPU Score + MEM Score + I/O Score (combined)  conditioned IDLE > 30% out of 24h,  are in between 3/15 and 14/15"
    },
    {
        "rule_id": "cloud_instance_ros_evaluation|INSTANCE_OVERSIZED",
        "description":"The instance is oversized and optimization is possible.",
        "reason": "Based on the host metrics set, we have detected that this {system_query.instance_type} instance on {system_query.cloud_provider.upper()} is not consuming fully the provided resources. It is leading us to a judgement that it can be oversized. We apply the logic of combination of all 3 scores with the amount of time within 24h your system spends idling, excluding non business hours.",
        "resolution": "Please pay attention to workloads running inside this RHEL instance, either utilizing your PCP tools or third party application specific tools to verify that the sizing of this ordered instance type from provider is optimized for your workload.",
        "condition":"CPU Score + MEM Score + I/O Score (combined)  conditioned IDLE < 30% out of 24h,  are lower than 9/15"
    },
    {
        "rule_id": "cloud_instance_ros_evaluation|INSTANCE_UNDERSIZED",
        "description":"This instance is undersized and optimization is possible.",
        "reason": "Based on the host metrics set, we have detected that this {system_query.instance_type} instance on {system_query.cloud_provider.upper()} is depleting the provided resources. It is leading us to a judgement that it can be undersized. We apply the logic of combination of all 3 scores with the amount of time within 24h your system spends idling, excluding non business hours.",
        "resolution": "Please pay attention to workloads running inside the RHEL instance, either utilizing your PCP tools or third party application specific tools to verify that the sizing of this ordered instance type from provider is optimized for your workload.",
        "condition":"CPU Score + MEM Score + I/O Score (combined)  conditioned IDLE < 30% out of 24h,  are exceeding 14/15"
    },
    {
        "rule_id": "cloud_instance_ros_evaluation|STORAGE_RIGHTSIZING",
        "description":"This instance is not sized properly so consider adding storage.",
        "reason": "Based on the host metrics set, we have detected that this {system_query.instance_type} instance on {system_query.cloud_provider.upper()} is running into the Storage I/O bottleneck. We apply the logic of combination of all 3 scores with the amount of time within 24h your system spends idling, excluding non business hours.",
        "resolution": "Please pay attention to attached Storage of the RHEL instance, either utilizing your PCP tools or third party application specific tools to verify that the sizing of storage for this ordered instance type from provider is optimized for your workload.",
        "condition":"CPU Score > 3 out of 5, MEM Score > 3 out of 5, I/O score > 4 out of 5, combined with I/O WAIT > 10% of cycles"
    }
]